## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/26b831cd-373c-4fa1-8009-af147456a2c5/resourceGroups/Terraform-workshops/providers/Microsoft.ContainerService/managedClusters/lorenzo-dev-aks"
        name                                = "lorenzo-dev-aks"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_postgresql_flexible_server.postgres will be created
  + resource "azurerm_postgresql_flexible_server" "postgres" {
      + administrator_login           = "psqladmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "lorenzo-dev-postgres"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "Terraform-workshops"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"
      + zone                          = "2"

      + authentication (known after apply)
    }

  # azurerm_private_dns_zone.postgres-dns-zone will be created
  + resource "azurerm_private_dns_zone" "postgres-dns-zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "lorenzo.dev.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "Terraform-workshops"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.postgres-dns-zone-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres-dns-zone-link" {
      + id                    = (known after apply)
      + name                  = "lorenzo-dev-vnet-postgres-link"
      + private_dns_zone_name = "lorenzo.dev.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "Terraform-workshops"
      + virtual_network_id    = "/subscriptions/26b831cd-373c-4fa1-8009-af147456a2c5/resourceGroups/Terraform-workshops/providers/Microsoft.Network/virtualNetworks/lorenzo-dev-vn"
    }

  # azurerm_subnet.postgres-sn will be created
  + resource "azurerm_subnet" "postgres-sn" {
      + address_prefixes                              = [
          + "10.2.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "postgres-sn"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "Terraform-workshops"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "lorenzo-dev-vn"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>